Repository: villajohn/RappiTest
Catalog: RappiTest/*.lproj/Localizable.strings
Languages: es

# error_initcoder
source: init(coder:) has not been implemented
es: init(coder:) no ha sido implementado

source: Applications
es: Aplicaciones

source: About
es: Acerca

source: Contact
es: Contacto

# noResultsFound
source: No records found
es: No hay resultados disponibles

# shareAppMessage
source: Hey, check %@. You can download it from: %@
es: Te invito a descargar %@. Puedes utilizar la siguiente URL: %@

# aboutTitle
source: About Rappi Test
es: Acerca de Rappi Test

# aboutProject
source: About this Project
es: Acerca del Proyecto

# aboutProjectContent
source: RappiTest App born as one of the interview requirements for iOS position in Rappi.com. The main idea bout this project is check the technical abilities programming on Apple devices.
es: RappiTest nace a partir de uno de los requirimientos de la entrevista laboral para cubrir el cargo de Desarrollador en iOS para la empresa Rappi. La base del proyecto consiste en medir las habilidades técnicas del aspirante quien debe culminar la prueba en un plazo no mayor a 48 horas a patir de la fecha de recepción del documento con los detalles de la prueba. La prioridad de la prueba se basa en medir los conocimientos en desarrollo de aplicaciones móviles.

source: About Me
es: Acerca de Mi

# aboutMeContent
source: My name is Jhon Villalobos and trying to be part of Rappi.com family as iOS Developer. My first time developing was at the age of 7 when I learned to code in Basic in a summer class. After that I just changed the games in Windows 95 and 98. I work with HTML since 1998, PHP since 2004 adn Java since 2009. Since 2015 I'm working as Freelancer developing iOS Apps in Swift.
es: Me llamo Jhon Villalobos, aspiro al cargo de Desarrollar en iOS para Rappi.com. Mi primer contacto con desarrollo de aplicaciones fue a la edad de 7 años cuando aprendí a trabajar con Basic en un curso vacacional. Posterior a eso me dedicaba a modificar las apicaciones de Juegos que windows incluía en sus version 95 y 98, las cuales estaban desarrolladas en Basic. Desde 1998 trabajo con HTML y desde 2004 con PHP. En 2009 comencé a trabajar en Java desarrollando distintas aplicaciones móviles y de escritorio. En 2015 me formé en como desarrollador de iOS (Swift), desde entonces sólo me dedico al desarrollo de aplicaciones móviles en Swift.

# subjectEmail
source: Contact from Rappi Test iOS App
es: Contacto desde la App iOS de Rappi Test

# fileNotSaved
source: Couldn't write file
es: No esposible guardar el documento JSON

source: Close
es: Cerrar

source: Yes
es: Sí

# noNetwork
source: Can't connect to the server right now, do you want to get the last data saved in your device ?
es: La conexión con el servidor ha fallado, desea cargar la última lista que que obtuvo del servidor ?

# pullMessage
source: Pull to refresh the table
es: Desliza hacia abajo para actualizar
